tests/hartmann/mhdPimpleFoam/Ha=0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                       none;
    div(phi,U)                    Gauss linear;
    div(phiB,U)                   Gauss linear;
    div(phi,B)                    Gauss linear;
    div(phiB,((2*DBU)*(B&U)))     Gauss linear;
    div(phiB,((2*DBU)*B))         Gauss linear;
    div(phiB,((DB*sigma)*(B&U)))  Gauss linear;
    div(phiB,(EDB*B))             Gauss linear;
    div(phiInc,KB)                Gauss linear;
    //div(convection(phiB,(EDB*B))) Gauss linear;
    div(div(BB))                  Gauss linear;
    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phid,p)     Gauss limitedLinear 1;
    div(phi,e)      Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;
    div(phiv,p)     Gauss limitedLinear 1;
    div(phiInc,B)   Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
